{"name": "demodoc", "DOCTORINDEX": 7, "messages": [{"message": "Hello, welcome to the MAIA clinic.  I am here to help with your doctor profile.  First tell me your phone number.", "sender": "bot"}, {"message": "5192160386", "sender": "user"}, {"message": "And what is your street address?", "sender": "bot"}, {"message": "342 stewart st", "sender": "user"}, {"message": "What city is that in?", "sender": "bot"}, {"message": "ottawa", "sender": "user"}, {"message": "What is your date of birth?", "sender": "bot"}, {"message": "1995", "sender": "user"}, {"message": "And what is your gender?", "sender": "bot"}, {"message": "male", "sender": "user"}, {"message": "Do you have a specialty?", "sender": "bot"}, {"message": "oncology", "sender": "user"}, {"message": "Are there any specific patients you would like to keep an eye on?", "sender": "bot"}, {"message": "jane doe", "sender": "user"}, {"message": "Perfect, now that we know a bit about you do you have any questions for me?\nIf you would like to see the record of a particular patient ask 'record for patient X.'\nIf you would like to get articles on a subject ask 'can I see articles on X.'\nIf you would like me to have knowledge in a particular subject, ask 'can you learn about X.'\nIf you would like a potential diagnosis for a patient, ask 'diagnose patient with symptoms X.'", "sender": "bot"}, {"message": "record for patient jane doe", "sender": "user"}, {"message": "Name: janedoe\nPhone Number: 5192160386, Street Address: 342 stewart st, City: ottawa, Birthdate: 1997/09/11, Gender: female, Symptoms: im sick, Medications: no", "sender": "bot"}, {"message": "can i see articles on diabetes", "sender": "user"}, {"message": "1) [Association between central diabetes insipidus and type 2 diabetes mellitus].\n2) Pulmonary Langerhans Cell Histiocytosis in an Adult Male Presenting with Central Diabetes Insipidus and Diabetes Mellitus: A Case Report.\n3) Diabetes mellitus, diabetes insipidus, optic atrophy, and deafness: A case of Wolfram (DIDMOAD) syndrome.\n4) History of Diabetes Insipidus.\n5) Fatal Fournier's gangrene caused by Clostridium ramosum in a patient with central diabetes insipidus and insulin-dependent diabetes mellitus: a case report.\n6) One too many diabetes: the combination of hyperglycaemic hyperosmolar state and central diabetes insipidus.\n7) Refractory diabetes insipidus leading to diagnosis of type 2 diabetes mellitus and non-ketotic hyperglycemia in an adolescent male.\n8) Diabetes insipidus in pregnancy: how to advice the patient?\n9) A Copeptin-Based Approach in the Diagnosis of Diabetes Insipidus.\n10) Genetic forms of neurohypophyseal diabetes insipidus.\n11) Genetics of Diabetes Insipidus.\n12) Usefulness of anti-rabphilin-3A antibodies for diagnosing central diabetes insipidus in the third trimester of pregnancy.\n13) Diabetes Insipidus.\n14) [Case of distal renal tubular acidosis complicated with renal diabetes insipidus, showing aggravation of symptoms with occurrence of diabetes mellitus].\n15) Mice deficient for ERAD machinery component Sel1L develop central diabetes insipidus.\n16) Diabetes insipidus is an unfavorable prognostic factor for response to glucocorticoids in patients with autoimmune hypophysitis.\n17) Adipsic diabetes insipidus revealing a bifocal intracranial germinoma.\n18) [Coexistence of autoimmune polyglandular syndrome type 3 with diabetes insipidus].\n19) The value of urine specific gravity in detecting diabetes insipidus in a patient with uncontrolled diabetes mellitus: urine specific gravity in differential diagnosis.\n20) Diabetes insipidus and pregnancy.\n", "sender": "bot"}, {"message": "diagnose patient with vertigo, vomiting, sweat", "sender": "user"}, {"message": "[('diabetes', 0.19255893), ('tachycardia sinus', 0.17334808), ('coronary arteriosclerosis', 0.17149165), ('hypertensive disease', 0.15343471)]", "sender": "bot"}, {"message": "hi", "sender": "user"}, {"message": "Hi there, how can I help?", "sender": "bot"}, {"message": "bye", "sender": "user"}, {"message": "Have a nice day", "sender": "bot"}, {"message": "how can a patient quit smoking?", "sender": "user"}, {"message": "given the description the patient could be experiencing mental dependency on narcotics. it doesnâ\u0080\u0099t seem that the patient are physically dependent on narcotics currently. in time if the patient donâ\u0080\u0099t stop abusing narcotics the patient may develop physical dependence of the drugs. mental and emotional dependence on drugs is defined as a need for narcotics to achieve pleasure. physically dependent addicts require narcotics to stay alive. the patient can ask for expert help from a mental health doctor for drug addiction treatment. many former addicts have also found a way to keep the \"mental withdrawal\" in control by joining support groups like narcotics anonymous or alcoholics anonymous. these groups advocate complete lifestyle and belief change in order to recover from addiction. the patient can visit their websites at www. na. org or www. alcoholics-anonymous. org to look for a meeting near the patient.", "sender": "bot"}], "Phone Number": "5192160386", "Street Address": "342 stewart st", "City": "Ottawa", "Birthdate": "1995", "Gender": "male", "Specialty": "Oncology", "Patients": "Jane Doe"}