{"name": "reynadoerwald", "DOCTORINDEX": 7, "messages": [{"message": "Hello, welcome to the MAIA clinic.  I am here to help with your doctor profile.  First tell me your phone number.", "sender": "bot"}, {"message": "hi", "sender": "bot"}, {"message": "5192160386", "sender": "user"}, {"message": "And what is your street address?", "sender": "bot"}, {"message": "342 stewart st", "sender": "user"}, {"message": "And what is your street address?", "sender": "bot"}, {"message": "*nods*", "sender": "bot"}, {"message": "342 stewart st", "sender": "user"}, {"message": "And what is your street address?", "sender": "bot"}, {"message": "342 stewart st", "sender": "user"}, {"message": "What city is that in?", "sender": "bot"}, {"message": "ottawa", "sender": "user"}, {"message": "What is your date of birth?", "sender": "bot"}, {"message": "1997", "sender": "user"}, {"message": "And what is your gender?", "sender": "bot"}, {"message": "female", "sender": "user"}, {"message": "Do you have a specialty?", "sender": "bot"}, {"message": "oncology", "sender": "user"}, {"message": "Are there any specific patients you would like to keep an eye on?", "sender": "bot"}, {"message": "jane doe", "sender": "user"}, {"message": "Perfect, now that we know a bit about you do you have any questions for me?\nIf you would like to see the record of a particular patient ask 'record for patient X'\nIf you would like to get articles on a subject ask 'can I see articles on X'\nIf you would like me to have knowledge in a particular subject, ask 'can you learn about X'\nIf you would like a potential diagnosis for a patient, ask 'diagnose patient X'", "sender": "bot"}, {"message": "record for patient jane doe", "sender": "user"}, {"message": "Sorry that patient record does not exist", "sender": "bot"}, {"message": "hey", "sender": "bot"}, {"message": "record for patient jane doe", "sender": "user"}, {"message": "Sorry that patient record does not exist", "sender": "bot"}, {"message": "hey", "sender": "bot"}, {"message": "record for patient jane doe", "sender": "user"}, {"message": "Sorry that patient record does not exist", "sender": "bot"}, {"message": "I am glad! You are talking to me", "sender": "bot"}, {"message": "record for patient jane doe", "sender": "user"}, {"message": "Sorry that patient record does not exist", "sender": "bot"}, {"message": "hi there", "sender": "bot"}, {"message": "record for patient jane doe", "sender": "user"}, {"message": "Name: janedoe\nPhone Number: 5192160386\nStreet Address: 342 stewart st\nCity: ottawa\nBirthdate: 1997/09/11\nGender: female\nSymptoms: im sick\nMedications: no\n", "sender": "bot"}, {"message": "I am glad! You are talking to me", "sender": "bot"}, {"message": "diagnose patient with symptoms sweat, nausea", "sender": "user"}, {"message": null, "sender": "bot"}, {"message": "hey", "sender": "bot"}, {"message": "diagnose patient with symptoms sweat, nausea", "sender": "user"}, {"message": [["hypertensive disease"], ["diabetes"], ["coronary arteriosclerosis", "coronary heart disease"], ["myocardial infarction"], ["hypercholesterolemia"], ["gastroesophageal reflux disease"], ["hyperlipidemia"], ["ischemia"], ["paroxysmal dyspnea"], ["edema pulmonary"], ["tachycardia sinus"], ["hypertensive disease"], ["diabetes"], ["gastroesophageal reflux disease"], ["dehydration"], ["chronic kidney failure"], ["carcinoma"], ["pancreatitis"], ["hernia"], ["ulcer peptic"], ["gastritis"], ["colitis"], ["diverticulosis"], ["tricuspid valve insufficiency"], ["malignant tumor of colon", "carcinoma colon"], ["ketoacidosis diabetic"], ["gastroenteritis"], ["pyelonephritis"], ["cholecystitis"], ["hernia hiatal"], ["migraine disorders"], ["cholelithiasis", "biliary calculus"], ["ileus"]], "sender": "bot"}, {"message": "can i see articles on diabetes", "sender": "user"}, {"message": "1) [Association between central diabetes insipidus and type 2 diabetes mellitus].\nCentral diabetes insipidus is a rare disease of the hypothalamus and neurohypophysis. It is very unusually found in the adult with type 2 diabetes mellitus. It is manifested by a polydipsic polyuric syndrome, which must be distinguished from the poorly controlled type 2 diabetes mellitus. Given the similarity of both entities and the unusual nature of their coexistence, their suspicion is difficult. The case of a 72-year-old male with type 2 diabetes mellitus with poor insulin control (fasting hyperglycemia greater than 180 mg/dl) who had a long-standing polyuric syndrome is here presented. Hypernatremia and plasma osmolality elevated together with a low urinary osmolality led to the suspicion of diabetes insipidus, which was subsequently confirmed by the dehydration test and the administration of desmopressin sc. With 61% increase in the calculated urinary osmolarity one hour post desmopressin s.c., diabetes insipidus of central type was diagnosed. Nuclear Magnetic Resonance showed a bright spot with normal neurohypophysis, contributing to the diagnosis of the idiopathic form.\n2) Pulmonary Langerhans Cell Histiocytosis in an Adult Male Presenting with Central Diabetes Insipidus and Diabetes Mellitus: A Case Report.\nPulmonary Langerhans cell histiocytosis is an uncommon diffuse cystic lung disease in adults. In rare cases, it can involve extrapulmonary organs and lead to endocrine abnormalities such as central diabetes insipidus. A 42-year-old man presented with polyphagia and polydipsia, as well as a dry cough and dyspnea on exertion. Magnetic resonance imaging of the hypothalamic-pituitary system failed to show the posterior pituitary, which is a typical finding in patients with central diabetes insipidus. This condition was confirmed by a water deprivation test, and the patient was also found to have type 2 diabetes mellitus. Computed tomographic scanning of the lungs revealed multiple, irregularly shaped cystic lesions and small nodules bilaterally, with sparing of the costophrenic angles. Lung biopsy through video-assisted thoracoscopic surgery revealed pulmonary Langerhans cell histiocytosis. On a follow-up visit, only 1 year after the patient had quit smoking, clinical and radiological improvement was significant. Here, we report an uncommon case of pulmonary Langerhans cell histiocytosis that simultaneously presented with diabetes insipidus and diabetes mellitus. \n3) Diabetes mellitus, diabetes insipidus, optic atrophy, and deafness: A case of Wolfram (DIDMOAD) syndrome.\nTo report a case of Wolfram syndrome (WS) characterized by diabetes mellitus, diabetes insipidus, progressive optic atrophy, and deafness.\n4) History of Diabetes Insipidus.\nUnder physiological conditions, fluid and electrolyte homoeostasis is maintained by the kidney adjusting urine volume and composition according to body needs. Diabetes Insipidus is a complex and heterogeneous clinical syndrome affecting water balance and characterized by constant diuresis, resulting in large volumes of dilute urine. With respect to the similarly named Diabetes Mellitus, a disease already known in ancient Egypt, Greece and Asia, Diabetes Insipidus has been described several thousand years later. In 1670s Thomas Willis, noted the difference in taste of urine from polyuric subjects compared with healthy individuals and started the differentiation of Diabetes Mellitus from the more rare entity of Diabetes Insipidus. In 1794, Johann Peter Frank described polyuric patients excreting nonsaccharine urine and introduced the term of Diabetes Insipidus. An hystorical milestone was the in 1913, when Farini successfully used posterior pituitary extracts to treat Diabetes Insipidus. Until 1920s the available evidence indicated Diabetes Insipidus as a disorder of the pituitary gland. In the early 1928, De Lange first observed that some patients with Diabetes Insipidus did not respond to posterior pituitary extracts and subsequently Forssman and Waring in 1945 established that the kidney had a critical role for these forms of Diabetes Insipidus resistant to this treatment. In 1947 Williams and Henry introduced the term Nephrogenic Diabetes Insipidus for the congenital syndrome characterized by polyuria and renal concentrating defect resistant to vasopressin. In 1955, du Vigneaud received the 1955 Nobel Prize in chemistry for the first synthesis of the hormone vasopressin representing a milestone for the treatment of Central Diabetes Insipidus. \n5) Fatal Fournier's gangrene caused by Clostridium ramosum in a patient with central diabetes insipidus and insulin-dependent diabetes mellitus: a case report.\nClostridium ramosum is a generally non-pathogenic enteric anaerobe, and Fournier's gangrene is a rare necrotizing soft tissue infection with male predisposition affecting the perineum and the genital area. We report, to our knowledge, the first case of Fournier's gangrene caused by C. ramosum in a female patient with multiple underlying conditions.\n6) One too many diabetes: the combination of hyperglycaemic hyperosmolar state and central diabetes insipidus.\nThe combination of hyperosmolar hyperglycaemic state and central diabetes insipidus is unusual and poses unique diagnostic and therapeutic challenges for clinicians. In a patient with diabetes mellitus presenting with polyuria and polydipsia, poor glycaemic control is usually the first aetiology that is considered, and achieving glycaemic control remains the first course of action. However, severe hypernatraemia, hyperglycaemia and discordance between urine-specific gravity and urine osmolality suggest concurrent symptomatic diabetes insipidus. We report a rare case of concurrent manifestation of hyperosmolar hyperglycaemic state and central diabetes insipidus in a patient with a history of craniopharyngioma.\n7) Refractory diabetes insipidus leading to diagnosis of type 2 diabetes mellitus and non-ketotic hyperglycemia in an adolescent male.\nNo Abstract\n8) Diabetes insipidus in pregnancy: how to advice the patient?\nDiabetes insipidus, characterized by polyuria and polydipsia, is a rare disease during pregnancy. Nevertheless, its recognition is important to avoid complications due to dehydration and hypernatremia. Its manifestation during pregnancy ranges from exacerbation of pre-existing central or nephrogenic diabetes insipidus to transient pregnancy-induced diabetes insipidus due to the increased metabolism of the antidiuretic hormone vasopressin (AVP) by the placental vasopressinase. Diagnosis can be challenging, as urinary frequency is common during pregnancy and primary polydipsia also needs to be excluded. Also, the standard water deprivation test is not recommended during pregnancy due to the increased risk of complications. Treatment depends upon the final diagnosis, with desmopressin (DDAVP) being the medication of choice in AVP-deficient diabetes insipidus, whereas nephrogenic diabetes insipidus requires treatment of the underlying disease and supportive measures.\n9) A Copeptin-Based Approach in the Diagnosis of Diabetes Insipidus.\nThe indirect water-deprivation test is the current reference standard for the diagnosis of diabetes insipidus. However, it is technically cumbersome to administer, and the results are often inaccurate. The current study compared the indirect water-deprivation test with direct detection of plasma copeptin, a precursor-derived surrogate of arginine vasopressin.\n10) Genetic forms of neurohypophyseal diabetes insipidus.\nNeurohypophyseal diabetes insipidus is characterized by polyuria and polydipsia owing to partial or complete deficiency of the antidiuretic hormone, arginine vasopressin (AVP). Although in most patients non-hereditary causes underlie the disorder, genetic forms have long been recognized and studied both in vivo and in vitro. In most affected families, the disease is transmitted in an autosomal dominant manner, whereas autosomal recessive forms are much less frequent. Both phenotypes can be caused by mutations in the vasopressin-neurophysin II (AVP) gene. In transfected cells expressing dominant mutations, the mutated hormone precursor is retained in the endoplasmic reticulum, where it forms fibrillar aggregates. Autopsy studies in humans and a murine knock-in model suggest that the dominant phenotype results from toxicity to vasopressinergic neurons, but the mechanisms leading to cell death remain unclear. Recessive transmission results from AVP with reduced biologic activity or the deletion of the locus. Genetic neurohypophyseal diabetes insipidus occurring in the context of diabetes mellitus, optic atrophy, and deafness is termed DIDMOAD or Wolfram syndrome, a genetically and phenotypically heterogeneous autosomal recessive disorder caused by mutations in the wolframin (WFS 1) gene.\n11) Genetics of Diabetes Insipidus.\nDiabetes insipidus is a disease characterized by polyuria and polydipsia due to inadequate release of arginine vasopressin from the posterior pituitary gland (neurohypophyseal diabetes insipidus) or due to arginine vasopressin insensitivity by the renal distal tubule, leading to a deficiency in tubular water reabsorption (nephrogenic diabetes insipidus). This article reviews the genetics of diabetes insipidus in the context of its diagnosis, clinical presentation, and therapy.\n12) Usefulness of anti-rabphilin-3A antibodies for diagnosing central diabetes insipidus in the third trimester of pregnancy.\nWe report a 27-year-old pregnant woman with polyuria, polydipsia and headache in the third trimester of pregnancy. Hypernatremia (153 mEq/L), high plasma osmolality (300 mOsm/kgH<sub>2</sub>O) and low urinary osmolality (92 mOsm/kgH<sub>2</sub>O) were observed at the admission to our hospital. Plasma arginine vasopressin (AVP) level was inappropriately low (2.2 pg/mL) compared to the high plasma osmolality. Plasma AVP responses to hypertonic-saline infusion were blunted, and her urine osmolality increased in response to desmopressin. The diagnosis of central diabetes insipidus was made from these results. Magnetic resonance imaging (MRI) of hypothalamic-pituitary region demonstrated a significant enlargement of the pituitary stalk, suggesting the presence of hypophysitis. In addition, serum anti-rabphilin-3A antibodies that have been recently reported as a biomarker of lymphocytic infundibulo-neurohypophysitis, were positive. Diabetes insipidus continued after delivery, suggesting that polyuria was not mainly due to excessive vasopressinase activity or reduced renal sensitivity to AVP by prostaglandin E<sub>2</sub> that can cause temporal polyuria during pregnancy. We therefore clinically diagnosed central diabetes insipidus due to lymphocytic infundibulo-neurohypophysitis, without performing invasive transsphenoidal pituitary biopsy. This case suggested the usefulness of anti-rabphilin-3A antibodies for the etiological diagnosis of central diabetes insipidus during pregnancy.\n13) [Case of distal renal tubular acidosis complicated with renal diabetes insipidus, showing aggravation of symptoms with occurrence of diabetes mellitus].\nWe report herein a 27-year-old male case of inherited distal renal tubular acidosis complicated with renal diabetes insipidus, the symptoms of which were aggravated by the occurrence of diabetes mellitus. At 2 months after birth, he was diagnosed as having inherited distal renal tubular acidosis and thereafter supplementation of both potassium and alkali was started to treat his hypokalemia and metabolic acidosis. At the age of 4 years, calcification of the bilateral renal medulla was detected by computed tomography. Subsequently his urinary volume gradually increased and polyuria of approximately 4 L/day persisted. At the age of 27 years, he became fond of sugar-sweetened drinks and also often forgot to take the medicine. He was admitted to our hospital due to polyuria of more than 10 L day, muscle weakness and gait disturbance. Laboratory tests disclosed worsening of both hypokalemia and metabolic acidosis in addition to severe hyperglycemia. It seemed likely that occurrence of diabetes mellitus and cessation of medications can induce osmotic diuresis and aggravate hypokalemia and metabolic acidosis. Consequently, severe dehydration, hypokalemia-induced damage of his urinary concentration ability and enhancement of the renin angiotensin system occurred and thereby possibly worsened his hypokalemia and metabolic acidosis. As normalization of hyperglycemia and metabolic acidosis might have exacerbated hypokalemia further, dehydration and hypokalemia were treated first. Following intensive treatment, these abnormalities were improved, but polyuria persisted. Elevated plasma antidiuretic hormone (12.0 pg/mL) and deficit of renal responses to antidiuretic hormone suggested that the polyuria was attributable to the preexisting renal diabetes insipidus possibly caused by bilateral renal medulla calcification. Thiazide diuretic or nonsteroidal anti-inflammatory drugs were not effective for the treatment of diabetes insipidus in the present case.\n14) Diabetes Insipidus.\nDisruption of water and electrolyte balance is frequently encountered in clinical medicine. Regulating water metabolism is critically important. Diabetes insipidus (DI) presented with excessive water loss from the kidney is a major disorder of water metabolism. To understand the molecular and cellular mechanisms and pathophysiology of DI and rationales of clinical management of DI is important for both research and clinical practice. This chapter will first review various forms of DI focusing on central diabetes insipidus (CDI) and nephrogenic diabetes insipidus (NDI ) . This is followed by a discussion of regulatory mechanisms underlying CDI and NDI , with a focus on the regulatory axis of vasopressin, vasopressin receptor 2 (V2R ) and the water channel molecule, aquaporin 2 (AQP2 ). The clinical manifestation, diagnosis and management of various forms of DI will also be discussed with highlights of some of the latest therapeutic strategies that are developed from in vitro experiments and animal studies.\n15) Mice deficient for ERAD machinery component Sel1L develop central diabetes insipidus.\nDeficiency of the antidiuretic hormone arginine vasopressin (AVP) underlies diabetes insipidus, which is characterized by the excretion of abnormally large volumes of dilute urine and persistent thirst. In this issue of the JCI, Shi et al. report that Sel1L-Hrd1 ER-associated degradation (ERAD) is responsible for the clearance of misfolded pro-arginine vasopressin (proAVP) in the ER. Additionally, mice with Sel1L deficiency, either globally or specifically within AVP-expressing neurons, developed central diabetes insipidus. The results of this study demonstrate a role for ERAD in neuroendocrine cells and serve as a clinical example of the effect of misfolded ER proteins retrotranslocated through the membrane into the cytosol, where they are polyubiquitinated, extracted from the ER membrane, and degraded by the proteasome. Moreover, proAVP misfolding in hereditary central diabetes insipidus likely shares common physiopathological mechanisms with proinsulin misfolding in hereditary diabetes mellitus of youth.\n16) Diabetes insipidus is an unfavorable prognostic factor for response to glucocorticoids in patients with autoimmune hypophysitis.\nAutoimmune hypophysitis (AH) has a variable clinical presentation and natural history; likewise, its response to glucocorticoid therapy is often unpredictable.\n17) Adipsic diabetes insipidus revealing a bifocal intracranial germinoma.\nAdipsic diabetes insipidus is a rare complication of intracranial tumors in which impaired antidiuretic hormone secretion is associated with the loss of thirst sensation. Here, we present the case of a patient with bifocal intracranial germinoma, diagnosed due to symptoms mainly caused by adipsic diabetes insipidus. This is, to our knowledge, the first case of adipsic diabetes insipidus revealing an intracranial germinoma reported in the literature. We describe the diagnostic procedures and the three-year follow-up of this patient. Management of intracranial germ-cell tumors is made complex by the wide range of histological features. Although germinomas have a generally better prognosis than most nongerminomatous tumors, they can have severe or even life-threatening presentations. Adipsic diabetes insipidus is one such severe presentation and its rarity can make it difficult to recognize and manage. Awareness of this potential entity is therefore important for clinical practice.\n18) The value of urine specific gravity in detecting diabetes insipidus in a patient with uncontrolled diabetes mellitus: urine specific gravity in differential diagnosis.\nWhen a patient with diabetes mellitus presents with worsening polyuria and polydipsia, what is a sensible, cost-effective approach? We report the unique coincidence of type 2 diabetes mellitus and diabetes insipidus. A 46-year-old woman with poorly controlled type 2 diabetes complained of polyuria with a daily output of 5 L. Although urinalysis demonstrated significant glucosuria, diabetes insipidus was suspected owing to a low urine specific gravity (1.008). The low specific gravity persisted during a water deprivation test. Ultimately, diabetes insipidus was confirmed when urine specific gravity and urine osmolality normalized following desmopressin administration. This case emphasizes the importance of accurately interpreting the urine specific gravity in patients with polyuria and diabetes mellitus to detect diabetes insipidus.\n19) [Coexistence of autoimmune polyglandular syndrome type 3 with diabetes insipidus].\nAutoimmune polyglandular syndromes are conditions characterized by the combination of two or more organ-specific disorders. The underestimation oftheir real frequency probable results from physicians' inadequate knowledge of these clinical entities and sometimes their atypical clinical presentation. Because they comprise a wide spectrum of autoimmune disorders, autoimmune polyglandular syndromes are divided into four types, among which type-3 is the most common one. In this article, we report the case of a young female, initially diagnosed with diabetes mellitus who several years later developed full-blown autoimmune polyglandular syndrome type 3 consisting of autoimmune thyroid disorder and latent autoimmune diabetes in adults.The discussed case suggests that in selected patients diabetes insipidus may coexist with autoimmune endocrinopathies and nonendocrine autoimmunopathies, as well as that in some patients idiopathic diabetes insipidus may be secondary to lymphocytic infiltration and destruction of the hypothalamic supraoptic and paraventricular nuclei and/or the supraoptic-hypophyseal tract\n20) Diabetes insipidus and pregnancy.\nDiabetes insipidus (DI) is a rare complication of pregnancy. It is usually transient, being due to increased placental production of vasopressinase that inactivates circulating vasopressin. Gestational, transient DI occurs late in pregnancy and disappears few days after delivery. Acquired central DI can also occur during pregnancy, for example in a patient with hypophysitis or neuroinfundibulitis during late pregnancy or postpartum. Finally, pre-existing central or nephrogenic DI may occasionally be unmasked by pregnancy. Treatment with dDAVP (desmopressin, Minirin(®)) is very effective on transient DI of pregnancy and also on pre-existing or acquired central DI. Contrary to vasopressin, dDAVP is not degraded by vasopressinase. Nephrogenic DI is insensitive to dDAVP and is therefore more difficult to treat during pregnancy if fluid intake needs to be restricted. \n", "sender": "bot"}, {"message": "*nods*", "sender": "bot"}, {"message": "hi there", "sender": "bot"}, {"message": "hey", "sender": "bot"}, {"message": "record for patient jane doe", "sender": "user"}, {"message": "Name: janedoe\nPhone Number: 5192160386, Street Address: 342 stewart st, City: ottawa, Birthdate: 1997/09/11, Gender: female, Symptoms: im sick, Medications: no", "sender": "bot"}, {"message": "diagnose patient with symptoms sweat, nausea", "sender": "user"}, {"message": [["hypertensive disease"], ["diabetes"], ["coronary arteriosclerosis", "coronary heart disease"], ["myocardial infarction"], ["hypercholesterolemia"], ["gastroesophageal reflux disease"], ["hyperlipidemia"], ["ischemia"], ["paroxysmal dyspnea"], ["edema pulmonary"], ["tachycardia sinus"], ["hypertensive disease"], ["diabetes"], ["gastroesophageal reflux disease"], ["dehydration"], ["chronic kidney failure"], ["carcinoma"], ["pancreatitis"], ["hernia"], ["ulcer peptic"], ["gastritis"], ["colitis"], ["diverticulosis"], ["tricuspid valve insufficiency"], ["malignant tumor of colon", "carcinoma colon"], ["ketoacidosis diabetic"], ["gastroenteritis"], ["pyelonephritis"], ["cholecystitis"], ["hernia hiatal"], ["migraine disorders"], ["cholelithiasis", "biliary calculus"], ["ileus"]], "sender": "bot"}, {"message": "can i see articles on diabetes", "sender": "user"}, {"message": "1) [Association between central diabetes insipidus and type 2 diabetes mellitus].\nCentral diabetes insipidus is a rare disease of the hypothalamus and neurohypophysis. It is very unusually found in the adult with type 2 diabetes mellitus. It is manifested by a polydipsic polyuric syndrome, which must be distinguished from the poorly controlled type 2 diabetes mellitus. Given the similarity of both entities and the unusual nature of their coexistence, their suspicion is difficult. The case of a 72-year-old male with type 2 diabetes mellitus with poor insulin control (fasting hyperglycemia greater than 180 mg/dl) who had a long-standing polyuric syndrome is here presented. Hypernatremia and plasma osmolality elevated together with a low urinary osmolality led to the suspicion of diabetes insipidus, which was subsequently confirmed by the dehydration test and the administration of desmopressin sc. With 61% increase in the calculated urinary osmolarity one hour post desmopressin s.c., diabetes insipidus of central type was diagnosed. Nuclear Magnetic Resonance showed a bright spot with normal neurohypophysis, contributing to the diagnosis of the idiopathic form.\n2) Pulmonary Langerhans Cell Histiocytosis in an Adult Male Presenting with Central Diabetes Insipidus and Diabetes Mellitus: A Case Report.\nPulmonary Langerhans cell histiocytosis is an uncommon diffuse cystic lung disease in adults. In rare cases, it can involve extrapulmonary organs and lead to endocrine abnormalities such as central diabetes insipidus. A 42-year-old man presented with polyphagia and polydipsia, as well as a dry cough and dyspnea on exertion. Magnetic resonance imaging of the hypothalamic-pituitary system failed to show the posterior pituitary, which is a typical finding in patients with central diabetes insipidus. This condition was confirmed by a water deprivation test, and the patient was also found to have type 2 diabetes mellitus. Computed tomographic scanning of the lungs revealed multiple, irregularly shaped cystic lesions and small nodules bilaterally, with sparing of the costophrenic angles. Lung biopsy through video-assisted thoracoscopic surgery revealed pulmonary Langerhans cell histiocytosis. On a follow-up visit, only 1 year after the patient had quit smoking, clinical and radiological improvement was significant. Here, we report an uncommon case of pulmonary Langerhans cell histiocytosis that simultaneously presented with diabetes insipidus and diabetes mellitus. \n3) Diabetes mellitus, diabetes insipidus, optic atrophy, and deafness: A case of Wolfram (DIDMOAD) syndrome.\nTo report a case of Wolfram syndrome (WS) characterized by diabetes mellitus, diabetes insipidus, progressive optic atrophy, and deafness.\n4) History of Diabetes Insipidus.\nUnder physiological conditions, fluid and electrolyte homoeostasis is maintained by the kidney adjusting urine volume and composition according to body needs. Diabetes Insipidus is a complex and heterogeneous clinical syndrome affecting water balance and characterized by constant diuresis, resulting in large volumes of dilute urine. With respect to the similarly named Diabetes Mellitus, a disease already known in ancient Egypt, Greece and Asia, Diabetes Insipidus has been described several thousand years later. In 1670s Thomas Willis, noted the difference in taste of urine from polyuric subjects compared with healthy individuals and started the differentiation of Diabetes Mellitus from the more rare entity of Diabetes Insipidus. In 1794, Johann Peter Frank described polyuric patients excreting nonsaccharine urine and introduced the term of Diabetes Insipidus. An hystorical milestone was the in 1913, when Farini successfully used posterior pituitary extracts to treat Diabetes Insipidus. Until 1920s the available evidence indicated Diabetes Insipidus as a disorder of the pituitary gland. In the early 1928, De Lange first observed that some patients with Diabetes Insipidus did not respond to posterior pituitary extracts and subsequently Forssman and Waring in 1945 established that the kidney had a critical role for these forms of Diabetes Insipidus resistant to this treatment. In 1947 Williams and Henry introduced the term Nephrogenic Diabetes Insipidus for the congenital syndrome characterized by polyuria and renal concentrating defect resistant to vasopressin. In 1955, du Vigneaud received the 1955 Nobel Prize in chemistry for the first synthesis of the hormone vasopressin representing a milestone for the treatment of Central Diabetes Insipidus. \n5) Fatal Fournier's gangrene caused by Clostridium ramosum in a patient with central diabetes insipidus and insulin-dependent diabetes mellitus: a case report.\nClostridium ramosum is a generally non-pathogenic enteric anaerobe, and Fournier's gangrene is a rare necrotizing soft tissue infection with male predisposition affecting the perineum and the genital area. We report, to our knowledge, the first case of Fournier's gangrene caused by C. ramosum in a female patient with multiple underlying conditions.\n6) One too many diabetes: the combination of hyperglycaemic hyperosmolar state and central diabetes insipidus.\nThe combination of hyperosmolar hyperglycaemic state and central diabetes insipidus is unusual and poses unique diagnostic and therapeutic challenges for clinicians. In a patient with diabetes mellitus presenting with polyuria and polydipsia, poor glycaemic control is usually the first aetiology that is considered, and achieving glycaemic control remains the first course of action. However, severe hypernatraemia, hyperglycaemia and discordance between urine-specific gravity and urine osmolality suggest concurrent symptomatic diabetes insipidus. We report a rare case of concurrent manifestation of hyperosmolar hyperglycaemic state and central diabetes insipidus in a patient with a history of craniopharyngioma.\n7) Refractory diabetes insipidus leading to diagnosis of type 2 diabetes mellitus and non-ketotic hyperglycemia in an adolescent male.\nNo Abstract\n8) Diabetes insipidus in pregnancy: how to advice the patient?\nDiabetes insipidus, characterized by polyuria and polydipsia, is a rare disease during pregnancy. Nevertheless, its recognition is important to avoid complications due to dehydration and hypernatremia. Its manifestation during pregnancy ranges from exacerbation of pre-existing central or nephrogenic diabetes insipidus to transient pregnancy-induced diabetes insipidus due to the increased metabolism of the antidiuretic hormone vasopressin (AVP) by the placental vasopressinase. Diagnosis can be challenging, as urinary frequency is common during pregnancy and primary polydipsia also needs to be excluded. Also, the standard water deprivation test is not recommended during pregnancy due to the increased risk of complications. Treatment depends upon the final diagnosis, with desmopressin (DDAVP) being the medication of choice in AVP-deficient diabetes insipidus, whereas nephrogenic diabetes insipidus requires treatment of the underlying disease and supportive measures.\n9) A Copeptin-Based Approach in the Diagnosis of Diabetes Insipidus.\nThe indirect water-deprivation test is the current reference standard for the diagnosis of diabetes insipidus. However, it is technically cumbersome to administer, and the results are often inaccurate. The current study compared the indirect water-deprivation test with direct detection of plasma copeptin, a precursor-derived surrogate of arginine vasopressin.\n10) Genetic forms of neurohypophyseal diabetes insipidus.\nNeurohypophyseal diabetes insipidus is characterized by polyuria and polydipsia owing to partial or complete deficiency of the antidiuretic hormone, arginine vasopressin (AVP). Although in most patients non-hereditary causes underlie the disorder, genetic forms have long been recognized and studied both in vivo and in vitro. In most affected families, the disease is transmitted in an autosomal dominant manner, whereas autosomal recessive forms are much less frequent. Both phenotypes can be caused by mutations in the vasopressin-neurophysin II (AVP) gene. In transfected cells expressing dominant mutations, the mutated hormone precursor is retained in the endoplasmic reticulum, where it forms fibrillar aggregates. Autopsy studies in humans and a murine knock-in model suggest that the dominant phenotype results from toxicity to vasopressinergic neurons, but the mechanisms leading to cell death remain unclear. Recessive transmission results from AVP with reduced biologic activity or the deletion of the locus. Genetic neurohypophyseal diabetes insipidus occurring in the context of diabetes mellitus, optic atrophy, and deafness is termed DIDMOAD or Wolfram syndrome, a genetically and phenotypically heterogeneous autosomal recessive disorder caused by mutations in the wolframin (WFS 1) gene.\n11) Genetics of Diabetes Insipidus.\nDiabetes insipidus is a disease characterized by polyuria and polydipsia due to inadequate release of arginine vasopressin from the posterior pituitary gland (neurohypophyseal diabetes insipidus) or due to arginine vasopressin insensitivity by the renal distal tubule, leading to a deficiency in tubular water reabsorption (nephrogenic diabetes insipidus). This article reviews the genetics of diabetes insipidus in the context of its diagnosis, clinical presentation, and therapy.\n12) Usefulness of anti-rabphilin-3A antibodies for diagnosing central diabetes insipidus in the third trimester of pregnancy.\nWe report a 27-year-old pregnant woman with polyuria, polydipsia and headache in the third trimester of pregnancy. Hypernatremia (153 mEq/L), high plasma osmolality (300 mOsm/kgH<sub>2</sub>O) and low urinary osmolality (92 mOsm/kgH<sub>2</sub>O) were observed at the admission to our hospital. Plasma arginine vasopressin (AVP) level was inappropriately low (2.2 pg/mL) compared to the high plasma osmolality. Plasma AVP responses to hypertonic-saline infusion were blunted, and her urine osmolality increased in response to desmopressin. The diagnosis of central diabetes insipidus was made from these results. Magnetic resonance imaging (MRI) of hypothalamic-pituitary region demonstrated a significant enlargement of the pituitary stalk, suggesting the presence of hypophysitis. In addition, serum anti-rabphilin-3A antibodies that have been recently reported as a biomarker of lymphocytic infundibulo-neurohypophysitis, were positive. Diabetes insipidus continued after delivery, suggesting that polyuria was not mainly due to excessive vasopressinase activity or reduced renal sensitivity to AVP by prostaglandin E<sub>2</sub> that can cause temporal polyuria during pregnancy. We therefore clinically diagnosed central diabetes insipidus due to lymphocytic infundibulo-neurohypophysitis, without performing invasive transsphenoidal pituitary biopsy. This case suggested the usefulness of anti-rabphilin-3A antibodies for the etiological diagnosis of central diabetes insipidus during pregnancy.\n13) [Case of distal renal tubular acidosis complicated with renal diabetes insipidus, showing aggravation of symptoms with occurrence of diabetes mellitus].\nWe report herein a 27-year-old male case of inherited distal renal tubular acidosis complicated with renal diabetes insipidus, the symptoms of which were aggravated by the occurrence of diabetes mellitus. At 2 months after birth, he was diagnosed as having inherited distal renal tubular acidosis and thereafter supplementation of both potassium and alkali was started to treat his hypokalemia and metabolic acidosis. At the age of 4 years, calcification of the bilateral renal medulla was detected by computed tomography. Subsequently his urinary volume gradually increased and polyuria of approximately 4 L/day persisted. At the age of 27 years, he became fond of sugar-sweetened drinks and also often forgot to take the medicine. He was admitted to our hospital due to polyuria of more than 10 L day, muscle weakness and gait disturbance. Laboratory tests disclosed worsening of both hypokalemia and metabolic acidosis in addition to severe hyperglycemia. It seemed likely that occurrence of diabetes mellitus and cessation of medications can induce osmotic diuresis and aggravate hypokalemia and metabolic acidosis. Consequently, severe dehydration, hypokalemia-induced damage of his urinary concentration ability and enhancement of the renin angiotensin system occurred and thereby possibly worsened his hypokalemia and metabolic acidosis. As normalization of hyperglycemia and metabolic acidosis might have exacerbated hypokalemia further, dehydration and hypokalemia were treated first. Following intensive treatment, these abnormalities were improved, but polyuria persisted. Elevated plasma antidiuretic hormone (12.0 pg/mL) and deficit of renal responses to antidiuretic hormone suggested that the polyuria was attributable to the preexisting renal diabetes insipidus possibly caused by bilateral renal medulla calcification. Thiazide diuretic or nonsteroidal anti-inflammatory drugs were not effective for the treatment of diabetes insipidus in the present case.\n14) Diabetes Insipidus.\nDisruption of water and electrolyte balance is frequently encountered in clinical medicine. Regulating water metabolism is critically important. Diabetes insipidus (DI) presented with excessive water loss from the kidney is a major disorder of water metabolism. To understand the molecular and cellular mechanisms and pathophysiology of DI and rationales of clinical management of DI is important for both research and clinical practice. This chapter will first review various forms of DI focusing on central diabetes insipidus (CDI) and nephrogenic diabetes insipidus (NDI ) . This is followed by a discussion of regulatory mechanisms underlying CDI and NDI , with a focus on the regulatory axis of vasopressin, vasopressin receptor 2 (V2R ) and the water channel molecule, aquaporin 2 (AQP2 ). The clinical manifestation, diagnosis and management of various forms of DI will also be discussed with highlights of some of the latest therapeutic strategies that are developed from in vitro experiments and animal studies.\n15) Mice deficient for ERAD machinery component Sel1L develop central diabetes insipidus.\nDeficiency of the antidiuretic hormone arginine vasopressin (AVP) underlies diabetes insipidus, which is characterized by the excretion of abnormally large volumes of dilute urine and persistent thirst. In this issue of the JCI, Shi et al. report that Sel1L-Hrd1 ER-associated degradation (ERAD) is responsible for the clearance of misfolded pro-arginine vasopressin (proAVP) in the ER. Additionally, mice with Sel1L deficiency, either globally or specifically within AVP-expressing neurons, developed central diabetes insipidus. The results of this study demonstrate a role for ERAD in neuroendocrine cells and serve as a clinical example of the effect of misfolded ER proteins retrotranslocated through the membrane into the cytosol, where they are polyubiquitinated, extracted from the ER membrane, and degraded by the proteasome. Moreover, proAVP misfolding in hereditary central diabetes insipidus likely shares common physiopathological mechanisms with proinsulin misfolding in hereditary diabetes mellitus of youth.\n16) Diabetes insipidus is an unfavorable prognostic factor for response to glucocorticoids in patients with autoimmune hypophysitis.\nAutoimmune hypophysitis (AH) has a variable clinical presentation and natural history; likewise, its response to glucocorticoid therapy is often unpredictable.\n17) Adipsic diabetes insipidus revealing a bifocal intracranial germinoma.\nAdipsic diabetes insipidus is a rare complication of intracranial tumors in which impaired antidiuretic hormone secretion is associated with the loss of thirst sensation. Here, we present the case of a patient with bifocal intracranial germinoma, diagnosed due to symptoms mainly caused by adipsic diabetes insipidus. This is, to our knowledge, the first case of adipsic diabetes insipidus revealing an intracranial germinoma reported in the literature. We describe the diagnostic procedures and the three-year follow-up of this patient. Management of intracranial germ-cell tumors is made complex by the wide range of histological features. Although germinomas have a generally better prognosis than most nongerminomatous tumors, they can have severe or even life-threatening presentations. Adipsic diabetes insipidus is one such severe presentation and its rarity can make it difficult to recognize and manage. Awareness of this potential entity is therefore important for clinical practice.\n18) The value of urine specific gravity in detecting diabetes insipidus in a patient with uncontrolled diabetes mellitus: urine specific gravity in differential diagnosis.\nWhen a patient with diabetes mellitus presents with worsening polyuria and polydipsia, what is a sensible, cost-effective approach? We report the unique coincidence of type 2 diabetes mellitus and diabetes insipidus. A 46-year-old woman with poorly controlled type 2 diabetes complained of polyuria with a daily output of 5 L. Although urinalysis demonstrated significant glucosuria, diabetes insipidus was suspected owing to a low urine specific gravity (1.008). The low specific gravity persisted during a water deprivation test. Ultimately, diabetes insipidus was confirmed when urine specific gravity and urine osmolality normalized following desmopressin administration. This case emphasizes the importance of accurately interpreting the urine specific gravity in patients with polyuria and diabetes mellitus to detect diabetes insipidus.\n19) [Coexistence of autoimmune polyglandular syndrome type 3 with diabetes insipidus].\nAutoimmune polyglandular syndromes are conditions characterized by the combination of two or more organ-specific disorders. The underestimation oftheir real frequency probable results from physicians' inadequate knowledge of these clinical entities and sometimes their atypical clinical presentation. Because they comprise a wide spectrum of autoimmune disorders, autoimmune polyglandular syndromes are divided into four types, among which type-3 is the most common one. In this article, we report the case of a young female, initially diagnosed with diabetes mellitus who several years later developed full-blown autoimmune polyglandular syndrome type 3 consisting of autoimmune thyroid disorder and latent autoimmune diabetes in adults.The discussed case suggests that in selected patients diabetes insipidus may coexist with autoimmune endocrinopathies and nonendocrine autoimmunopathies, as well as that in some patients idiopathic diabetes insipidus may be secondary to lymphocytic infiltration and destruction of the hypothalamic supraoptic and paraventricular nuclei and/or the supraoptic-hypophyseal tract\n20) Diabetes insipidus and pregnancy.\nDiabetes insipidus (DI) is a rare complication of pregnancy. It is usually transient, being due to increased placental production of vasopressinase that inactivates circulating vasopressin. Gestational, transient DI occurs late in pregnancy and disappears few days after delivery. Acquired central DI can also occur during pregnancy, for example in a patient with hypophysitis or neuroinfundibulitis during late pregnancy or postpartum. Finally, pre-existing central or nephrogenic DI may occasionally be unmasked by pregnancy. Treatment with dDAVP (desmopressin, Minirin(®)) is very effective on transient DI of pregnancy and also on pre-existing or acquired central DI. Contrary to vasopressin, dDAVP is not degraded by vasopressinase. Nephrogenic DI is insensitive to dDAVP and is therefore more difficult to treat during pregnancy if fluid intake needs to be restricted. \n", "sender": "bot"}, {"message": "what are symptoms of cancer", "sender": "user"}, {"message": "[26][27]\nsigns and symptoms\nmain article: cancer signs and symptoms\nsymptoms of cancer metastasis depend on the location of the tumor.", "sender": "bot"}, {"message": "what are symptoms of cancer", "sender": "user"}, {"message": "what are symptoms of cancer", "sender": "bot"}, {"message": "hello", "sender": "user"}, {"message": "I am sorry! I don't understand you", "sender": "bot"}, {"message": "hi", "sender": "user"}, {"message": "I am sorry! I don't understand you", "sender": "bot"}, {"message": "hi", "sender": "user"}, {"message": "I am sorry! I don't understand you. If you would like to see the record of a particular patient ask 'record for patient X'\nIf you would like to get articles on a subject ask 'can I see articles on X'\nIf you would like me to have knowledge in a particular subject, ask 'can you learn about X'\nIf you would like a potential diagnosis for a patient, ask 'diagnose patient with symptoms X'", "sender": "bot"}, {"message": "hi", "sender": "user"}, {"message": "I am sorry! I don't understand you. If you would like to see the record of a particular patient ask 'record for patient X.'\nIf you would like to get articles on a subject ask 'can I see articles on X.'\nIf you would like me to have knowledge in a particular subject, ask 'can you learn about X.'\nIf you would like a potential diagnosis for a patient, ask 'diagnose patient with symptoms X.'", "sender": "bot"}, {"message": "record for patient jane doe", "sender": "user"}, {"message": "Name: janedoe\nPhone Number: 5192160386, Street Address: 342 stewart st, City: ottawa, Birthdate: 1997/09/11, Gender: female, Symptoms: im sick, Medications: no", "sender": "bot"}, {"message": "can i see articles on diabetes", "sender": "user"}, {"message": "1) [Association between central diabetes insipidus and type 2 diabetes mellitus].\nCentral diabetes insipidus is a rare disease of the hypothalamus and neurohypophysis. It is very unusually found in the adult with type 2 diabetes mellitus. It is manifested by a polydipsic polyuric syndrome, which must be distinguished from the poorly controlled type 2 diabetes mellitus. Given the similarity of both entities and the unusual nature of their coexistence, their suspicion is difficult. The case of a 72-year-old male with type 2 diabetes mellitus with poor insulin control (fasting hyperglycemia greater than 180 mg/dl) who had a long-standing polyuric syndrome is here presented. Hypernatremia and plasma osmolality elevated together with a low urinary osmolality led to the suspicion of diabetes insipidus, which was subsequently confirmed by the dehydration test and the administration of desmopressin sc. With 61% increase in the calculated urinary osmolarity one hour post desmopressin s.c., diabetes insipidus of central type was diagnosed. Nuclear Magnetic Resonance showed a bright spot with normal neurohypophysis, contributing to the diagnosis of the idiopathic form.\n2) Pulmonary Langerhans Cell Histiocytosis in an Adult Male Presenting with Central Diabetes Insipidus and Diabetes Mellitus: A Case Report.\nPulmonary Langerhans cell histiocytosis is an uncommon diffuse cystic lung disease in adults. In rare cases, it can involve extrapulmonary organs and lead to endocrine abnormalities such as central diabetes insipidus. A 42-year-old man presented with polyphagia and polydipsia, as well as a dry cough and dyspnea on exertion. Magnetic resonance imaging of the hypothalamic-pituitary system failed to show the posterior pituitary, which is a typical finding in patients with central diabetes insipidus. This condition was confirmed by a water deprivation test, and the patient was also found to have type 2 diabetes mellitus. Computed tomographic scanning of the lungs revealed multiple, irregularly shaped cystic lesions and small nodules bilaterally, with sparing of the costophrenic angles. Lung biopsy through video-assisted thoracoscopic surgery revealed pulmonary Langerhans cell histiocytosis. On a follow-up visit, only 1 year after the patient had quit smoking, clinical and radiological improvement was significant. Here, we report an uncommon case of pulmonary Langerhans cell histiocytosis that simultaneously presented with diabetes insipidus and diabetes mellitus. \n3) Diabetes mellitus, diabetes insipidus, optic atrophy, and deafness: A case of Wolfram (DIDMOAD) syndrome.\nTo report a case of Wolfram syndrome (WS) characterized by diabetes mellitus, diabetes insipidus, progressive optic atrophy, and deafness.\n4) History of Diabetes Insipidus.\nUnder physiological conditions, fluid and electrolyte homoeostasis is maintained by the kidney adjusting urine volume and composition according to body needs. Diabetes Insipidus is a complex and heterogeneous clinical syndrome affecting water balance and characterized by constant diuresis, resulting in large volumes of dilute urine. With respect to the similarly named Diabetes Mellitus, a disease already known in ancient Egypt, Greece and Asia, Diabetes Insipidus has been described several thousand years later. In 1670s Thomas Willis, noted the difference in taste of urine from polyuric subjects compared with healthy individuals and started the differentiation of Diabetes Mellitus from the more rare entity of Diabetes Insipidus. In 1794, Johann Peter Frank described polyuric patients excreting nonsaccharine urine and introduced the term of Diabetes Insipidus. An hystorical milestone was the in 1913, when Farini successfully used posterior pituitary extracts to treat Diabetes Insipidus. Until 1920s the available evidence indicated Diabetes Insipidus as a disorder of the pituitary gland. In the early 1928, De Lange first observed that some patients with Diabetes Insipidus did not respond to posterior pituitary extracts and subsequently Forssman and Waring in 1945 established that the kidney had a critical role for these forms of Diabetes Insipidus resistant to this treatment. In 1947 Williams and Henry introduced the term Nephrogenic Diabetes Insipidus for the congenital syndrome characterized by polyuria and renal concentrating defect resistant to vasopressin. In 1955, du Vigneaud received the 1955 Nobel Prize in chemistry for the first synthesis of the hormone vasopressin representing a milestone for the treatment of Central Diabetes Insipidus. \n5) Fatal Fournier's gangrene caused by Clostridium ramosum in a patient with central diabetes insipidus and insulin-dependent diabetes mellitus: a case report.\nClostridium ramosum is a generally non-pathogenic enteric anaerobe, and Fournier's gangrene is a rare necrotizing soft tissue infection with male predisposition affecting the perineum and the genital area. We report, to our knowledge, the first case of Fournier's gangrene caused by C. ramosum in a female patient with multiple underlying conditions.\n6) One too many diabetes: the combination of hyperglycaemic hyperosmolar state and central diabetes insipidus.\nThe combination of hyperosmolar hyperglycaemic state and central diabetes insipidus is unusual and poses unique diagnostic and therapeutic challenges for clinicians. In a patient with diabetes mellitus presenting with polyuria and polydipsia, poor glycaemic control is usually the first aetiology that is considered, and achieving glycaemic control remains the first course of action. However, severe hypernatraemia, hyperglycaemia and discordance between urine-specific gravity and urine osmolality suggest concurrent symptomatic diabetes insipidus. We report a rare case of concurrent manifestation of hyperosmolar hyperglycaemic state and central diabetes insipidus in a patient with a history of craniopharyngioma.\n7) Refractory diabetes insipidus leading to diagnosis of type 2 diabetes mellitus and non-ketotic hyperglycemia in an adolescent male.\nNo Abstract\n8) Diabetes insipidus in pregnancy: how to advice the patient?\nDiabetes insipidus, characterized by polyuria and polydipsia, is a rare disease during pregnancy. Nevertheless, its recognition is important to avoid complications due to dehydration and hypernatremia. Its manifestation during pregnancy ranges from exacerbation of pre-existing central or nephrogenic diabetes insipidus to transient pregnancy-induced diabetes insipidus due to the increased metabolism of the antidiuretic hormone vasopressin (AVP) by the placental vasopressinase. Diagnosis can be challenging, as urinary frequency is common during pregnancy and primary polydipsia also needs to be excluded. Also, the standard water deprivation test is not recommended during pregnancy due to the increased risk of complications. Treatment depends upon the final diagnosis, with desmopressin (DDAVP) being the medication of choice in AVP-deficient diabetes insipidus, whereas nephrogenic diabetes insipidus requires treatment of the underlying disease and supportive measures.\n9) A Copeptin-Based Approach in the Diagnosis of Diabetes Insipidus.\nThe indirect water-deprivation test is the current reference standard for the diagnosis of diabetes insipidus. However, it is technically cumbersome to administer, and the results are often inaccurate. The current study compared the indirect water-deprivation test with direct detection of plasma copeptin, a precursor-derived surrogate of arginine vasopressin.\n10) Genetic forms of neurohypophyseal diabetes insipidus.\nNeurohypophyseal diabetes insipidus is characterized by polyuria and polydipsia owing to partial or complete deficiency of the antidiuretic hormone, arginine vasopressin (AVP). Although in most patients non-hereditary causes underlie the disorder, genetic forms have long been recognized and studied both in vivo and in vitro. In most affected families, the disease is transmitted in an autosomal dominant manner, whereas autosomal recessive forms are much less frequent. Both phenotypes can be caused by mutations in the vasopressin-neurophysin II (AVP) gene. In transfected cells expressing dominant mutations, the mutated hormone precursor is retained in the endoplasmic reticulum, where it forms fibrillar aggregates. Autopsy studies in humans and a murine knock-in model suggest that the dominant phenotype results from toxicity to vasopressinergic neurons, but the mechanisms leading to cell death remain unclear. Recessive transmission results from AVP with reduced biologic activity or the deletion of the locus. Genetic neurohypophyseal diabetes insipidus occurring in the context of diabetes mellitus, optic atrophy, and deafness is termed DIDMOAD or Wolfram syndrome, a genetically and phenotypically heterogeneous autosomal recessive disorder caused by mutations in the wolframin (WFS 1) gene.\n11) Genetics of Diabetes Insipidus.\nDiabetes insipidus is a disease characterized by polyuria and polydipsia due to inadequate release of arginine vasopressin from the posterior pituitary gland (neurohypophyseal diabetes insipidus) or due to arginine vasopressin insensitivity by the renal distal tubule, leading to a deficiency in tubular water reabsorption (nephrogenic diabetes insipidus). This article reviews the genetics of diabetes insipidus in the context of its diagnosis, clinical presentation, and therapy.\n12) Usefulness of anti-rabphilin-3A antibodies for diagnosing central diabetes insipidus in the third trimester of pregnancy.\nWe report a 27-year-old pregnant woman with polyuria, polydipsia and headache in the third trimester of pregnancy. Hypernatremia (153 mEq/L), high plasma osmolality (300 mOsm/kgH<sub>2</sub>O) and low urinary osmolality (92 mOsm/kgH<sub>2</sub>O) were observed at the admission to our hospital. Plasma arginine vasopressin (AVP) level was inappropriately low (2.2 pg/mL) compared to the high plasma osmolality. Plasma AVP responses to hypertonic-saline infusion were blunted, and her urine osmolality increased in response to desmopressin. The diagnosis of central diabetes insipidus was made from these results. Magnetic resonance imaging (MRI) of hypothalamic-pituitary region demonstrated a significant enlargement of the pituitary stalk, suggesting the presence of hypophysitis. In addition, serum anti-rabphilin-3A antibodies that have been recently reported as a biomarker of lymphocytic infundibulo-neurohypophysitis, were positive. Diabetes insipidus continued after delivery, suggesting that polyuria was not mainly due to excessive vasopressinase activity or reduced renal sensitivity to AVP by prostaglandin E<sub>2</sub> that can cause temporal polyuria during pregnancy. We therefore clinically diagnosed central diabetes insipidus due to lymphocytic infundibulo-neurohypophysitis, without performing invasive transsphenoidal pituitary biopsy. This case suggested the usefulness of anti-rabphilin-3A antibodies for the etiological diagnosis of central diabetes insipidus during pregnancy.\n13) [Case of distal renal tubular acidosis complicated with renal diabetes insipidus, showing aggravation of symptoms with occurrence of diabetes mellitus].\nWe report herein a 27-year-old male case of inherited distal renal tubular acidosis complicated with renal diabetes insipidus, the symptoms of which were aggravated by the occurrence of diabetes mellitus. At 2 months after birth, he was diagnosed as having inherited distal renal tubular acidosis and thereafter supplementation of both potassium and alkali was started to treat his hypokalemia and metabolic acidosis. At the age of 4 years, calcification of the bilateral renal medulla was detected by computed tomography. Subsequently his urinary volume gradually increased and polyuria of approximately 4 L/day persisted. At the age of 27 years, he became fond of sugar-sweetened drinks and also often forgot to take the medicine. He was admitted to our hospital due to polyuria of more than 10 L day, muscle weakness and gait disturbance. Laboratory tests disclosed worsening of both hypokalemia and metabolic acidosis in addition to severe hyperglycemia. It seemed likely that occurrence of diabetes mellitus and cessation of medications can induce osmotic diuresis and aggravate hypokalemia and metabolic acidosis. Consequently, severe dehydration, hypokalemia-induced damage of his urinary concentration ability and enhancement of the renin angiotensin system occurred and thereby possibly worsened his hypokalemia and metabolic acidosis. As normalization of hyperglycemia and metabolic acidosis might have exacerbated hypokalemia further, dehydration and hypokalemia were treated first. Following intensive treatment, these abnormalities were improved, but polyuria persisted. Elevated plasma antidiuretic hormone (12.0 pg/mL) and deficit of renal responses to antidiuretic hormone suggested that the polyuria was attributable to the preexisting renal diabetes insipidus possibly caused by bilateral renal medulla calcification. Thiazide diuretic or nonsteroidal anti-inflammatory drugs were not effective for the treatment of diabetes insipidus in the present case.\n14) Diabetes Insipidus.\nDisruption of water and electrolyte balance is frequently encountered in clinical medicine. Regulating water metabolism is critically important. Diabetes insipidus (DI) presented with excessive water loss from the kidney is a major disorder of water metabolism. To understand the molecular and cellular mechanisms and pathophysiology of DI and rationales of clinical management of DI is important for both research and clinical practice. This chapter will first review various forms of DI focusing on central diabetes insipidus (CDI) and nephrogenic diabetes insipidus (NDI ) . This is followed by a discussion of regulatory mechanisms underlying CDI and NDI , with a focus on the regulatory axis of vasopressin, vasopressin receptor 2 (V2R ) and the water channel molecule, aquaporin 2 (AQP2 ). The clinical manifestation, diagnosis and management of various forms of DI will also be discussed with highlights of some of the latest therapeutic strategies that are developed from in vitro experiments and animal studies.\n15) Mice deficient for ERAD machinery component Sel1L develop central diabetes insipidus.\nDeficiency of the antidiuretic hormone arginine vasopressin (AVP) underlies diabetes insipidus, which is characterized by the excretion of abnormally large volumes of dilute urine and persistent thirst. In this issue of the JCI, Shi et al. report that Sel1L-Hrd1 ER-associated degradation (ERAD) is responsible for the clearance of misfolded pro-arginine vasopressin (proAVP) in the ER. Additionally, mice with Sel1L deficiency, either globally or specifically within AVP-expressing neurons, developed central diabetes insipidus. The results of this study demonstrate a role for ERAD in neuroendocrine cells and serve as a clinical example of the effect of misfolded ER proteins retrotranslocated through the membrane into the cytosol, where they are polyubiquitinated, extracted from the ER membrane, and degraded by the proteasome. Moreover, proAVP misfolding in hereditary central diabetes insipidus likely shares common physiopathological mechanisms with proinsulin misfolding in hereditary diabetes mellitus of youth.\n16) Diabetes insipidus is an unfavorable prognostic factor for response to glucocorticoids in patients with autoimmune hypophysitis.\nAutoimmune hypophysitis (AH) has a variable clinical presentation and natural history; likewise, its response to glucocorticoid therapy is often unpredictable.\n17) Adipsic diabetes insipidus revealing a bifocal intracranial germinoma.\nAdipsic diabetes insipidus is a rare complication of intracranial tumors in which impaired antidiuretic hormone secretion is associated with the loss of thirst sensation. Here, we present the case of a patient with bifocal intracranial germinoma, diagnosed due to symptoms mainly caused by adipsic diabetes insipidus. This is, to our knowledge, the first case of adipsic diabetes insipidus revealing an intracranial germinoma reported in the literature. We describe the diagnostic procedures and the three-year follow-up of this patient. Management of intracranial germ-cell tumors is made complex by the wide range of histological features. Although germinomas have a generally better prognosis than most nongerminomatous tumors, they can have severe or even life-threatening presentations. Adipsic diabetes insipidus is one such severe presentation and its rarity can make it difficult to recognize and manage. Awareness of this potential entity is therefore important for clinical practice.\n18) The value of urine specific gravity in detecting diabetes insipidus in a patient with uncontrolled diabetes mellitus: urine specific gravity in differential diagnosis.\nWhen a patient with diabetes mellitus presents with worsening polyuria and polydipsia, what is a sensible, cost-effective approach? We report the unique coincidence of type 2 diabetes mellitus and diabetes insipidus. A 46-year-old woman with poorly controlled type 2 diabetes complained of polyuria with a daily output of 5 L. Although urinalysis demonstrated significant glucosuria, diabetes insipidus was suspected owing to a low urine specific gravity (1.008). The low specific gravity persisted during a water deprivation test. Ultimately, diabetes insipidus was confirmed when urine specific gravity and urine osmolality normalized following desmopressin administration. This case emphasizes the importance of accurately interpreting the urine specific gravity in patients with polyuria and diabetes mellitus to detect diabetes insipidus.\n19) [Coexistence of autoimmune polyglandular syndrome type 3 with diabetes insipidus].\nAutoimmune polyglandular syndromes are conditions characterized by the combination of two or more organ-specific disorders. The underestimation oftheir real frequency probable results from physicians' inadequate knowledge of these clinical entities and sometimes their atypical clinical presentation. Because they comprise a wide spectrum of autoimmune disorders, autoimmune polyglandular syndromes are divided into four types, among which type-3 is the most common one. In this article, we report the case of a young female, initially diagnosed with diabetes mellitus who several years later developed full-blown autoimmune polyglandular syndrome type 3 consisting of autoimmune thyroid disorder and latent autoimmune diabetes in adults.The discussed case suggests that in selected patients diabetes insipidus may coexist with autoimmune endocrinopathies and nonendocrine autoimmunopathies, as well as that in some patients idiopathic diabetes insipidus may be secondary to lymphocytic infiltration and destruction of the hypothalamic supraoptic and paraventricular nuclei and/or the supraoptic-hypophyseal tract\n20) Diabetes insipidus and pregnancy.\nDiabetes insipidus (DI) is a rare complication of pregnancy. It is usually transient, being due to increased placental production of vasopressinase that inactivates circulating vasopressin. Gestational, transient DI occurs late in pregnancy and disappears few days after delivery. Acquired central DI can also occur during pregnancy, for example in a patient with hypophysitis or neuroinfundibulitis during late pregnancy or postpartum. Finally, pre-existing central or nephrogenic DI may occasionally be unmasked by pregnancy. Treatment with dDAVP (desmopressin, Minirin(®)) is very effective on transient DI of pregnancy and also on pre-existing or acquired central DI. Contrary to vasopressin, dDAVP is not degraded by vasopressinase. Nephrogenic DI is insensitive to dDAVP and is therefore more difficult to treat during pregnancy if fluid intake needs to be restricted. \n", "sender": "bot"}, {"message": "diagnose patient with symptoms sweat, nausea", "sender": "user"}, {"message": [["hypertensive disease"], ["diabetes"], ["coronary arteriosclerosis", "coronary heart disease"], ["myocardial infarction"], ["hypercholesterolemia"], ["gastroesophageal reflux disease"], ["hyperlipidemia"], ["ischemia"], ["paroxysmal dyspnea"], ["edema pulmonary"], ["tachycardia sinus"], ["hypertensive disease"], ["diabetes"], ["gastroesophageal reflux disease"], ["dehydration"], ["chronic kidney failure"], ["carcinoma"], ["pancreatitis"], ["hernia"], ["ulcer peptic"], ["gastritis"], ["colitis"], ["diverticulosis"], ["tricuspid valve insufficiency"], ["malignant tumor of colon", "carcinoma colon"], ["ketoacidosis diabetic"], ["gastroenteritis"], ["pyelonephritis"], ["cholecystitis"], ["hernia hiatal"], ["migraine disorders"], ["cholelithiasis", "biliary calculus"], ["ileus"]], "sender": "bot"}, {"message": "hey", "sender": "bot"}, {"message": "hey", "sender": "bot"}, {"message": "hey", "sender": "bot"}, {"message": "hi there", "sender": "bot"}, {"message": "*nods*", "sender": "bot"}, {"message": "I am glad! You are talking to me", "sender": "bot"}, {"message": "hi there", "sender": "bot"}, {"message": "I am glad! You are talking to me", "sender": "bot"}], "Phone Number": "342 stewart st", "Street Address": "342 stewart st", "City": "Ottawa", "Birthdate": "1997", "Gender": "Female", "Specialty": "Oncology", "Patients": "Jane Doe"}